brew "libpng"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "bat"
brew "bison"
brew "freetype"
brew "gettext"
brew "chezmoi"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gd"
brew "gh"
brew "libiconv"
brew "git"
brew "gmp"
brew "gopls"
brew "icu4c@78"
brew "htop"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "krb5"
brew "libedit"
brew "libsodium"
brew "libxml2"
brew "libyaml"
brew "libzip"
brew "llvm"
brew "mise"
brew "nmap"
brew "openssl@1.1"
brew "pkgconf"
brew "pyright"
brew "re2c"
brew "ripgrep"
brew "rust-analyzer"
brew "starship"
brew "typescript-language-server"
brew "uv"
brew "vim"
brew "yq"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "ghostty"
cask "rectangle-pro"
vscode "1yib.rust-bundle"
vscode "anthropic.claude-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "codezombiech.gitignore"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dustypomerleau.rust-syntax"
vscode "fill-labs.dependi"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "intellsmi.comment-translate"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-typescript-next"
vscode "openai.chatgpt"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "waderyan.gitblame"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "zobo.php-intellisense"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "cmd/go"
go "github.com/rogpeppe/godef"
go "cmd/gofmt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "github.com/jstemmer/gotags"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "filetree"
cargo "keifu"
