brew "libpng"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "bat"
brew "bison"
brew "freetype"
brew "gettext"
brew "chezmoi"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gd"
brew "gh"
brew "libiconv"
brew "git"
brew "gmp"
brew "gopls"
brew "icu4c@78"
brew "htop"
brew "libzip"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "krb5"
brew "libedit"
brew "libsodium"
brew "libxml2"
brew "libyaml"
brew "llvm"
brew "mise"
brew "nmap"
brew "openssl@1.1"
brew "pkgconf"
brew "pyright"
brew "re2c"
brew "ripgrep"
brew "rust-analyzer"
brew "starship"
brew "typescript-language-server"
brew "uv"
brew "vim"
brew "yq"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "ghostty"
cask "rectangle-pro"
vscode "anthropic.claude-code"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "openai.chatgpt"
vscode "prisma.prisma"
vscode "tamasfe.even-better-toml"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "cmd/go"
go "github.com/rogpeppe/godef"
go "cmd/gofmt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "github.com/jstemmer/gotags"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "filetree"
cargo "keifu"
